code-review/NRB_3471_3546/База_Стало/Documents/ПринудительнаяБлокировкаЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПринудительнаяБлокировкаЦБ</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидКорпоративногоДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКорпоративныхДействий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХраненияСчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХраненияСчетДепоРаздел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий1024</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокДанныхБлокировки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДепо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетДепоРаздел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумагаСтатус</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыЦБ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/Documents/ПринудительнаяБлокировкаЦБ/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Дата							= ТекущаяДата();
		Объект.Инициатор					= Константы.ОрганизацияПоУмолчанию.Получить();
		Объект.ВидКорпоративногоДействия	= Справочники.ВидыКорпоративныхДействий.НайтиПоКоду("TEND");
		Объект.Автор						= ПараметрыСеанса.ТекущийПользователь;
		Если Объект.МестоХранения.Пустая() Тогда
			Объект.МестоХранения			= Константы.МестоХраненияПоУмолчанию.Получить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Оболочки.ПриЧтенииНаСервереДокумента(ЭтотОбъект, ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеБлокировкиСервер()
	Документ	= РеквизитФормыВЗначение("Объект");
	Документ.ЗаполнитьДанныеБлокировки();
	ЗначениеВРеквизитФормы(Документ, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанныеБлокировки(Команда)
	ЗаполнитьДанныеБлокировкиСервер();
КонецПроцедуры

&НаКлиенте
Процедура ЦеннаяБумагаПриИзменении(Элемент)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.СписокДанныхБлокировки.Очистить();
	Иначе 
		ОбъектСсылкаЦеннаяБумага = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Ссылка, "ЦеннаяБумага");
		Если Не ОбъектСсылкаЦеннаяБумага = Объект.ЦеннаяБумага Тогда
			Объект.СписокДанныхБлокировки.Очистить();
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МестоХраненияСчетДепоРазделПриИзменении(Элемент)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.СписокДанныхБлокировки.Очистить();
	Иначе
		ОбъектСсылкаМестоХраненияСчетДепоРаздел = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Ссылка, "МестоХраненияСчетДепоРаздел");
		Если Не ОбъектСсылкаМестоХраненияСчетДепоРаздел = Объект.МестоХраненияСчетДепоРаздел Тогда
			Объект.СписокДанныхБлокировки.Очистить();
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МестоХраненияСчетДепоПриИзменении(Элемент)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.СписокДанныхБлокировки.Очистить();
	Иначе
		ОбъектСсылкаМестоХраненияСчетДепо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Ссылка, "МестоХраненияСчетДепо");
		Если Не ОбъектСсылкаМестоХраненияСчетДепо = Объект.МестоХраненияСчетДепо Тогда
			Объект.СписокДанныхБлокировки.Очистить();
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МестоХраненияПриИзменении(Элемент)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.СписокДанныхБлокировки.Очистить();
	Иначе
		ОбъектСсылкаМестоХранения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Ссылка, "МестоХранения");
		Если Не ОбъектСсылкаМестоХранения = Объект.МестоХранения Тогда
			Объект.СписокДанныхБлокировки.Очистить();
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.СписокДанныхБлокировки.Очистить();
	Иначе
		ОбъектСсылкаДата = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Ссылка, "Дата");
		Если Не ОбъектСсылкаДата = Объект.Дата Тогда
			Объект.СписокДанныхБлокировки.Очистить();
		КонецЕсли;	
	КонецЕсли;
КонецПроцедуры
